[
  {
    "id": "Kilian-Valkhof",
    "title": "Kilian Valkhof",
    "image": {
      "src": "/images/kilian_valkhof.webp",
      "alt": "Kilian Valkhof"
    },
    "intro": "Kilian Valkhof over 'rule of least power'",
    "inleiding": "In deze blog bespreken ik de lezing van Kilian Valkhof. Kilian Valkhof is een Nederlandse front-end developer, spreker en ondernemer. <br><br>Hij is de oprichter van Polypane, een browser voor ontwikkelaars. Met een passie voor het verbeteren van het web deelt Valkhof regelmatig zijn kennis via blogs en presentaties.",
    "content": [
      {
        "titel": "Rule of Least Power",
        "alinea": [
          "Hij introduceerde het principe 'rule of least power', wat gaat over het kiezen van de minst complexe oplossing voor het probleem dat je hebt. Bijvoorbeeld, als je een probleem kunt oplossen met HTML, CSS of JavaScript, kies dan voor HTML.",
          "Hierbij gaf hij een aantal voorbeelden van nieuwe HTML oplossingen dat vooraf gedaan werd met Javascript. Hieronder een aantal voorbeelden:",
          "<ul><li>input type='color'</li><li>HTML accordion met summary en details element</li><li>dialog element</li></ul>"
        ]
      },
      {
        "titel": "Wat ik mee ga nemen",
        "alinea": [
          "Dit was mijn eerste indruk van nieuwe web development functies. het was erg interessant om te zien hoeveel je al kan doen met alleen HTML tags. Alhoewel was het voor mij wel veel informatie en ik begreep nog niet zo goed hoe ik de dingen die hij liet zien moest toepassen.",
          "Nu ik hier op terugkijk, word ik weer opnieuw enthousiast over de mogelijkheden die er zijn met HTML. Het geeft me een gevoel om meer uit te gaan zoeken wat er allemaal mogelijk is met enkel HTML en CSS. Het is een goede reminder dat je niet altijd de meest complexe oplossing hoeft te kiezen, maar dat er vaak eenvoudigere oplossingen zijn die ook goed werken."
        ]
      }
    ]
  },
  {
    "id": "Peter-Paul-Koch",
    "title": "Peter Paul Koch",
    "image": {
      "src": "/images/peter_paul_koch.webp",
      "alt": "Peter Paul Koch"
    },
    "intro": "Peter Paul Koch over web monetization",
    "inleiding": "Peter-Paul Koch, ook bekend als PPK, is een webontwikkelaar en consultant die bekend staat om zijn kennis op het gebied van browsercompatibiliteit en front-endontwikkeling. <br><br>Hij heeft zich ingezet voor het verbeteren van webstandaarden. Als oprichter van QuirksMode.org leverde hij waardevolle bijdragen aan de webgemeenschap met uitgebreide documentatie.",
    "content": [
      {
        "titel": "Web monetization",
        "alinea": [
          "Web monetization is een manier om websites te monetizen door middel van een browserextentie bij de bezoeker. Het idee is dat je een website kunt maken die automatisch betaald wordt door de bezoekers. Dit kan bijvoorbeeld door middel van een abonnement of door het betalen per bezoek.",
          "Hij gaf een aantal voorbeelden van hoe dit werkt en hoe je het kunt implementeren. Het idee is dat je een API kunt gebruiken om betalingen te verwerken en dat je dit kunt integreren in je website."
        ]
      },
      {
        "titel": "Wat ik mee ga nemen",
        "alinea": [
          "Nadat ik het verhaal van Peter had gehoord wist ik niet zo goed wat ik er van vond. Aan de ene kant vind ik het een goed initiatief om mensen te betalen voor het werk dat ze doen. Maar aan de andere kant denk ik niet dat dit de oplossing is voor het probleem dat we hebben met advertenties en privacy.",
          "In het geval dat iedereen dit systeem zou gebruiken is het erg goed voor de privacy maar de meeste gebruikers zijn zich er niet van bewust dat dit een probleem is. Ik vraag me af of mensen het een aantrekkelijke oplossing vinden om te betalen voor iets waar ze al 'gratis' toegang tot hebben door te betalen met hun gegevens of het zien van advertenties."
        ]
      }
    ]
  },
  {
    "id": "Roel-Nieskens",
    "title": "Roel Nieskens",
    "image": {
      "src": "/images/roel_nieskens.webp",
      "alt": "Roel Nieskens"
    },
    "intro": "Roel Nieskens over typografie",
    "inleiding": "Roel Nieskens is een front-end developer en typografiespecialist, bekend om zijn innovatieve werk op het gebied van typografie. <br><br>Op zijn website PixelAmbacht.nl deelt hij zijn inzichten en experimenten, waaronder projecten zoals Wakamai Fondue en Sans Bullshit Sans.",
    "content": [
      {
        "titel": "Typografie",
        "alinea": [
          "Typografie is een erg belangrijk onderwerp in de webwereld. Het is een onderwerp waar ik me voor de presentatie van Roel niet zo veel mee bezig heb gehouden. Roel liet zien wat er allemaal mogelijk is met fonts en hoe je dit creatief kan toepassen op het web.",
          "Hij gaf een aantal voorbeelden van variable fonts en hoe je deze op verschillende manieren kan toepassen en liet zien hoe je deze makkelijk kan animeren met CSS."
        ]
      },
      {
        "titel": "Wat ik mee ga nemen",
        "alinea": [
          "Dit was de eerste keer dat ik van variable fonts heb gehoord. Ik kreeg al meteen ideeën hoe ik dit kan toepassen om meer feedback te geven aan de gebruiker in websites door het font te animeren.",
          "Ik vind het erg cool dat je zo veel kan doen met alleen een font. Ik hoop dit vaker toe te kunnen passen in mijn eigen projecten."
        ]
      }
    ]
  },
  {
    "id": "Cassie-Evans",
    "title": "Cassie Evans",
    "image": {
      "src": "/images/cassie_evans.webp",
      "alt": "Cassie Evans"
    },
    "intro": "Cassie Evans over GSAP",
    "inleiding": "Cassie Evans is een creatieve ontwikkelaar die bekend staat om haar werk bij GreenSock (GSAP), een JavaScript-animatielibrary. <br><br>Met haar passie voor interactieve webanimaties en toegankelijke code, maakt ze lastige concepten voor animatie begrijpelijk.",
    "content": [
      {
        "titel": "GSAP",
        "alinea": [
          "De presentatie van Cassie ging over allerlei mogelijkheden voor animatie die je met de GSAP animatie library kan maken. Ze liet voorbeelden zien van verschillende functies:",
          "<ul><li>GSAP utils</li><li>easing</li><li>helper functions</li></ul>",
          "Dit werd allemaal erg snel uitgelegd en ik had niet echt het idee dat ik het goed begreep. Het was erg veel informatie in een korte tijd."
        ]
      },
      {
        "titel": "Wat ik mee ga nemen",
        "alinea": [
          "Dit was de eerste keer dat ik van GSAP heb gehoord. Ik zag al meteen dat hier heel veel mee mogelijk is maar de presentatie was voor mij erg veel en niet behapbaar.",
          "Het voelde meer alsof Cassie GSAP probeerde te verkopen in plaats van iets uit te leggen. Het maakte me niet enthousiast om GSAP te gaan gebruiken voor mijn volgende project.",
          "Ik zie wel de potentie maar ben momenteel meer geïnteresseerd in pure CSS animaties. Wellicht dat ik het in de toekomst ga gebruiken als ik het niet voor elkaar krijg met pure CSS."
        ]
      }
    ]
  },
  {
    "id": "Nils-binder",
    "title": "Nils Binder",
    "image": {
      "src": "/images/nils_binder.webp",
      "alt": "Nils Binder"
    },
    "intro": "Designen voor flexibiliteit",
    "inleiding": "Nils Binder is een ervaren front-end developer met een passie voor CSS en origami. <br><br>Bij 9elements werkt hij samen met een team om innovatieve projecten waar te maken.",
    "content": [
      {
        "titel": "Design for flexibility",
        "alinea": [
          "Nils heeft het tijdens zijn presentatie over designen voor flexibiliteit. Dit houdt in dat websites er goed uit zien op verschillende formaten schermen.",
          "Hij legt uit dat je dit op creatievere manieren kan doen naast het gebruiken van de 12 kolommen grid dat veel voorkomt. Ontwerpen in programma's zoals Figma zorgen dat je minder snel aan creatievere oplossingen denkt die je kan maken met CSS.",
          "Een voorbeeld hiervan is het gebruik van containers om de layout flexibel te maken en niet vast te zitten aan een grid."
        ]
      },
      {
        "titel": "Wat ik mee ga nemen",
        "alinea": [
          "Het idee van designen voor flexibiliteit sprak voor zich. 'Natuurlijk wil je dat je website er goed uitziet op verschillende schermen' dacht ik. Maar ik had er nog niet over nagedacht hoe dit gedaan kon worden.",
          "Bij de dingen die Nils liet zien zag ik meteen hoe dit nuttig is en dat het veel vrijheid geeft om je website eigen te maken. Het is een goede reminder dat je niet altijd vast hoeft te houden aan de standaard grids die er zijn.",
          "Ik wil zeker oefenen met het gebruiken van containers en flexbox om mijn websites flexibeler te maken."
        ]
      }
    ]
  },
  {
    "id": "Jeremy-Keith",
    "title": "Jeremy Keith",
    "image": {
      "src": "/images/jeremy_keith.webp",
      "alt": "Jeremy Keith"
    },
    "intro": "Imperative en declarative design",
    "inleiding": "Jeremy Keith is een webontwikkelaar en auteur die staat voor een toegankelijk en toekomstbestendig web. <br><br>Met zijn werk bij Clearleft en boeken als Resilient Web Design heeft hij een waardevolle stem in de web wereld.",
    "content": [
      {
        "titel": "Declarative & Imperative Programming",
        "alinea": [
          "Jeremy heeft het over het verschil tussen declarative en imperative programmeren. Dit zijn verschillende manieren om code te schrijven en hebben verschillende voordelen.",
          "Declarative programming is een manier van programmeren waarbij je beschrijft wat je wilt dat er gebeurt, zonder precies te zeggen hoe het moet gebeuren. Dit maakt de code vaak makkelijker te begrijpen. Een voorbeeld hiervan is het gebruik van CSS om de stijl van een website te beschrijven.",
          "Imperative programming is een manier van programmeren waarbij je precies beschrijft hoe iets moet gebeuren. Dit maakt de code vaak moeilijker te begrijpen. Als een onderdeel het niet doet, werkt het hele programma vaak niet. Een voorbeeld hiervan is het gebruik van JavaScript om de stijl van een website te beschrijven.",
          "Hetzelfde geldt voor de mindset van het team. Als je een team hebt met een declarative mindset, zijn ze vaak meer gebouwd op vertrouwen en kan je dingen op je eigen manier oplossen. Als het maar werkt.",
          "Als je een team hebt met een imperative mindset, zijn ze vaak meer gebouwd op controle en zit er een groter systeem achter. Dit kan leiden tot problemen als iemand iets anders doet dan de rest van het team."
        ]
      },
      {
        "titel": "Wat ik mee ga nemen",
        "alinea": [
          "Deze presentatie heeft mij inzicht gegeven in hoe de mindset van het team invloed heeft op hoe een project wordt afgehandeld. Het heeft me laten denken over hoe ik zelf werk en wat bij mij past.",
          "Ik vind het erg fijn om dingen op mijn eigen manier op te lossen en niet ergens aan vast te zitten. Maar aan de andere heb ik ook graag structuur voor wanneer dingen af moeten zijn.",
          "Dit is iets waar ik constant mee bezig kan zijn in de toekomst. Wat voor ontwikkelaar wil ik zijn? Op welke manier moet ik dit opgelost krijgen? En wat voor team wil ik om me heen hebben?"
        ]
      }
    ]
  },
  {
    "id": "Julia-Miocene",
    "title": "Julia Miocene",
    "image": {
      "src": "/images/julia_miocene.webp",
      "alt": "Julia Miocene"
    },
    "intro": "Julia Miocene over CSS animaties",
    "inleiding": "Julia Miocene is een webontwikkelaar die zich richt op CSS-animaties. <br><br>Ze heeft een passie voor het creëren van levendige visuals met pure CSS.",
    "content": [
      {
        "titel": "CSS Animaties",
        "alinea": [
          "Julia laat bij haar presentatie verschillende oude projecten zien waar ze alleen CSS gebruikt om levendige animaties te maken.",
          "Zij heeft laten zien dat er super veel mogelijk is met enkel CSS en dat er geen limiet is tot wat we ermee kunnen maken.",
          "In haar animaties is te zien dat ze een soort skelet bouwt in HTML en de verschillende onderdelen van dat skelet met CSS animeert. Dit zorgt ervoor dat positie van de onderdelen onafhankelijk zijn en op de juiste plek blijven staan relatief tot elkaar."
        ]
      },
      {
        "titel": "Wat ik mee ga nemen",
        "alinea": [
          "Om te zien wat er allemaal mogelijk is met enkel CSS maakte me erg enthousiast. Ik heb nog nooit zulke levendige animaties gezien die alleen met CSS zijn gemaakt.",
          "Ik had al eerder ervaring opgedaan met 'tekenen' met CSS toen ik met puur CSS een polaroid camera had gemaakt. Maar dit was een heel ander niveau.",
          "Hoewel ik heel graag meer wou weten is het ergens wel intimiderend en weet ik niet zeker in hoeverre dit in de praktijk haalbaar is om te maken.",
          "Het voelt meer als iets dat je in je vrije tijd kunt doen als hobby of kunst en minder iets dat je in praktijk gebruikt voor webproducten."
        ]
      }
    ]
  },
  {
    "id": "Rosa",
    "title": "Rosa",
    "intro": "Rosa over circuit bending",
    "inleiding": "Rosa is een oud-student bij CMD en is nu bezig bij Hackers United waar ze circuit bending en hardware hacking doet. <br><br>Ze heeft een passie voor het maken van muziek met oude hardware om ze nieuw leven te geven.",
    "content": [
      {
        "titel": "Circuit bending",
        "alinea": [
          "Rosa heeft het gehad over circuit bending. Dit houdt in dat je hardware kunt 'hacken' om het wat anders te laten doen dan waarvoor het origineel bedoeld was.",
          "Zij geeft aan dat het er vooral om gaat dat je bezig bent en niet te veel nadenkt over je plan.",
          "Apparaten van nu zijn vaak zo goed beveiligd dat je ze niet meer kunt openmaken. Dit maakt het moeilijk om ze te hacken. Maar met oude apparatuur is dit vaak nog wel mogelijk.",
          "Zij laat een aantal voorbeelden zien van dingen die ze heeft gemaakt en hoe ze dit heeft gedaan. Dit zijn vaak apparaten die ze zelf heeft gemaakt of oude apparaten die ze heeft omgebouwd."
        ]
      },
      {
        "titel": "Wat ik mee ga nemen",
        "alinea": [
          "Ik vond het erg leuk om te zien wat er allemaal mogelijk is met circuit bending. Ik had nog niet eerder op deze manier naar oude hardware gekeken.",
          "Ik ben zelf wel met oude hardware bezig geweest om ze te repareren of om te bouwen. Een voorbeeld hiervan is een polaroid camera uit de jaren 80 laten werken op oplaadbare batterijen. Het was leuk om te zien dat er veel meer andere mensen bezig zijn met soortgelijke projecten.",
          "Ik denk alleen niet dat ik dit goed kan toepassen op web development. Het is meer een hobby dat ik leuk vind om te doen maar niet echt iets dat ik in mijn werk kan gebruiken."
        ]
      }
    ]
  },
  {
    "id": "Niels-Leenheer",
    "title": "Niels Leenheer",
    "image": {
      "src": "/images/niels_leenheer.webp",
      "alt": "Niels Leenheer"
    },
    "intro": "Web technology op kassasystemen",
    "inleiding": "Niels is een ontwikkelaar werkzaam bij salonhub. <br><br>Hij heeft een passie voor het toepassen van web technologie op kassasystemen.",
    "content": [
      {
        "titel": "Web technology op kassasystemen",
        "alinea": [
          "Niels heeft het gehad over het toepassen van web technologie op kassasystemen. Dit is iets dat ik nog niet eerder had gehoord en het was erg interessant om te zien hoe dit werkt.",
          "Hij legt uit dat kassasystemen erg verouderd zijn en dat er veel mogelijkheden zijn om deze te verbeteren met web technologie.",
          "Hij laat per onderdeel zien hoe iets met web technologie kan werken:",
          "<ul><li>bonnenprinter</li><li>kassalade</li><li>klantenscherm</li><li>scanner</li></ul>",
          "Het voordeel hiervan is dat je niet afhankelijk bent van de leverancier van het systeem en zelf meer controle hebt aangezien alles open source is en je zelf kan bouwen wat je wilt."
        ]
      },
      {
        "titel": "Wat ik mee ga nemen",
        "alinea": [
          "Hoewel het gaaf was om te zien dat je ook andere dingen kan doen met web technologie dan alleen websites, denk ik niet dat ik dit ga toepassen in mijn werk.",
          "Het is een erg niche onderwerp en ik denk niet dat ik hier ooit mee te maken ga krijgen. Maar het was wel leuk om te zien dat er meer mogelijkheden zijn met web technologie dan alleen websites."
        ]
      }
    ]
  },
  {
    "id": "Nienke-de-Keijzer",
    "title": "Nienke de Keijzer",
    "image": {
      "src": "/images/nienke_de_keijzer.webp",
      "alt": "Nienke de Keijzer"
    },
    "intro": "Nienke de Keijzer over accessibility",
    "inleiding": "Nienke is een oud-student bij CMD die verteld over haar afstudeerproject bij BVG. <br><br>Zij legt uit hoe ze haar project heeft aangepakt en hoe ze de toegankelijkheid van de BVG app heeft verbeterd.",
    "content": [
      {
        "titel": "Accessibility",
        "alinea": [
          "Bij Nienke gaat accessibility erom dat je niemand uitsluit. Dit is iets dat ik erg belangrijk vind en waar ik zelf ook veel mee bezig ben.",
          "Dit begint al in de researchfase van het project. Het is belangrijk dat je voor accessibility op een persoonlijk niveau onderzoekt wie je wilt helpen.",
          "Zij heeft dit gedaan met een kleine groep mensen waarbij zij heeft getest en verschillende iteraties heeft gemaakt. Ook geeft zij aan dat je ook naar de mensen moet kijken waar ze veel contact mee hebben om andere inzichten te krijgen."
        ]
      },
      {
        "titel": "Wat ik mee ga nemen",
        "alinea": [
          "Ik vond het erg interessant om te zien hoe ontwerpen voor accessibility in de praktijk gedaan worden. Natuurlijk heb ik wel eerder gehoord dat je goed moet testen en op basis daarvan iteraties moet maken maar het was erg leuk om te zien dat dit daadwerkelijk resultaat heeft.",
          "Ik wil graag haar mindset meenemen voor mijn toekomstige projecten. Ik wil ook graag iedereen in de doelgroep meenemen in mijn product en het toegankelijk maken voor iedereen.",
          "Het is fijn om een voorbeeld te zien van hoe het moet."
        ]
      }
    ]
  },
  {
    "id": "Erik-Kroes",
    "title": "Erik Kroes",
    "image": {
      "src": "/images/erik_kroes.webp",
      "alt": "Erik Kroes"
    },
    "intro": "Erik Kroes fixes voor WCAG failures",
    "inleiding": "Erik is een consultant gespecialiseerd in onder andere toegankelijkheid. <br><br>Hij legt uit hoe je de toegankelijkheid van websites snel kan verbeteren door veel voorkomende WCAG failures aan te kaarten.",
    "content": [
      {
        "titel": "Fixes voor WCAG failures",
        "alinea": [
          "Erik heeft het tijdens zijn presentatie over bekende fouten in code waardoor een project niet door de WCAG guidelines komt. Vervolgens legt hij uit hoe je dit op een gemakkelijke manier kan voorkomen zonder al te veel werk.",
          "Volgens Erik moet je vooral op de volgende dingen letten:",
          "<ul><li>Is alles toegankelijk met enkel het toetsenbord?</li><li>Is het contrast tussen kleuren groot genoeg?</li><li>Zijn er alternatieven voor mensen die bepaalde dingen niet kunnen ervaren zoals captions op video's?</li><li>Is alle content te zien op alle schermformaten?</li></ul>"
        ]
      },
      {
        "titel": "Wat ik mee ga nemen",
        "alinea": [
          "Hoewel dit allemaal voor mij wel bekend klinkt, is het fijn om een reminder te krijgen. Ik pas dit momenteel al zo veel mogelijk toe in mijn eigen code. Ik heb helaas geen nieuwe dingen gehoord."
        ]
      }
    ]
  },
  {
    "id": "Dave-Bitter",
    "title": "Dave Bitter",
    "image": {
      "src": "/images/dave_bitter.webp",
      "alt": "Dave bitter"
    },
    "intro": "AI-powered Voice Interfaces",
    "inleiding": "Dave is een oud student bij CMD en is frontend consultant bij IO digital. Tijdens zijn talk legt hij de groei uit van AI voice interfaces.",
    "content": [
      {
        "titel": "The rise of AI-powered Voice Interfaces",
        "alinea": [
          "De presentatie begon met een korte geschiedenis van spraakherkenning. In de jaren 50-60 begon het net, in de jaren 70-80 konden korte zinnetjes worden herkend. In de jaren 90 werd er een grote stap vooruit gezet en rond 2000 kwam Google met toepassingen. In 2010 verschenen spraakassistenten zoals Siri en Alexa, en sindsdien zijn steminterfaces steeds gewoner geworden. Tegen 2020 werd het echt indrukwekkend. Hoewel tekstchat met AI populair is, voelt praten vaak natuurlijker aan.",
          "Om dat mogelijk tre maken gebruik je hardware zoals microfoons, in combinatie me de `SpeechRecognition` web API. De steminvoer gaat naar de computer, wordt doorgestuurd naar de AI en komt als reactie weer terug. De AI genereert een zin die vervolgens uitgesproken kan worden door middel van de SpeechSynthesis Web API. Zo ontstaat een interactief gesprek tussen gebruiker en AI.",
          "Hoe connect je dit met AI? Dit vraagstuk gaat ove hoe je een AI verteld hoe hij zich moet gedragen. Om de AI goed te laten reageren, moet je hem eerst uitleggen hoe hij gebruikt wordt. Daarna geef je hem een persoonlijkheid, en eventueel een rol. Die persoonlijkheid en de feedback die de gebruiker krijgt, zorgen voor een menselijker gevoel tijdens het gesprek.",
          "Voor nog realistischer stemmen kun je Elevenlabs inzetten. Dit maakt de stem levensechter, maar het leverde wel vertraging op: het duurde soms een minuut voordat je een reactie kreeg. Daardoor verslechterde de gespreksbeleving. Uiteindelijk bleek dat snelheid belangrijker was dan een goeie stem."
        ]
      },
      {
        "titel": "Wat ik mee ga nemen",
        "alinea": [
          "Ik vond het erg gaaf om te zien hoeveel er mogelijk is met Ai voice interfaces en hoe makkelijk het eigenlijk is om te maken door middel van bestaande web API's. Al is dit wel iets waar ik me niet zo snel in zou verdiepen, wil ik het wel graag uitbproberen nadat ik deze presentatie heb gehoord.",
          "Al heb ik wel zo mijn twijfels over het hele concept van op dze manier omgaan met onze apparaten, aangezien we op deze manier steeds meer met AI interactie hebben in plaats van andere mensen of zelf onderzoek doet naar onderwerpen waarbij je je eigen bronnen zoekt. Ik denk dat er wel een grote markt is waar deze interactie met AI thuis hoort."
        ]
      }
    ]
  },
    {
    "id": "Steve-Jonk",
    "title": "Steve Jonk",
    "image": {
      "src": "/images/steve_jonk.webp",
      "alt": "Steve Jonk"
    },
    "intro": "Steve bitter over zijn Twitter follow bot",
    "inleiding": "Steve Jonk is een front-end developer bij IO en werkt naast zijn werk bij IO ook nog voor zichzelf. Hij heeft een Twitter Bot gebouwd dat op het randje van legaal is.",
    "content": [
      {
        "titel": "Twitter Follow Bot and Follower Scraper",
        "alinea": [
          "Hoewel het project enigszins tegen de regels ingaat, werd hij er gewoon voor betaald en deed hij alles openlijk. De Twitter API is in principe beschikbaar voor iedereen, maar volledige toegang kost veel geld. Steve heeft echter een creatieve manier gevonden om deze beperkingen te omzeilen.",
          "Het systeem bestaat uit twee hoofdtaken: bepalen wie gevolgd moet worden, en het vervolgens daadwerkelijk uitvoeren van die follow-acties. Hiervoor gebruikte hij tools als N8N, Puppeteer, Postgres, Docker en natuurlijk de Twitter API.",
          "Een groot obstakel was de strijd met Twitter zelf. Het platform is erg streng tegenover bots, zeker als het gaat om volgen en ontvolgen. Daarom probeerde Steve het gedrag van de bot zo menselijk mogelijk te laten lijken door gebruik te maken van randomizers.",
          "In plaats van puur via de API te werken, gebruikte hij eenscraper om data van de website te halen en op te slaan in een eigen database. Niet alle gebruikersinformatie is direct zichtbaar dus moest er paginering toegepast worden. Zo kon hij steeds ongeveer 50 nieuwe volgers tegelijk binnenhalen."
        ]
      },
      {
        "titel": "Wat ik mee ga nemen",
        "alinea": [
          "Wat ik erg interresant vond aan deze talk los van dat het vanaf een ethisch aspect niet helemaal verantwoord is, is dat Steve erg creatieve manieren heeft gevonden om zijn problemen te omzeilen. Dit niviea van probleem oplossend nadenken zou ik ook willen kunnen.",
          "Het was erg leuk om hem zo enthousiast te horen praten over de oplossing en omwegen die hij heeft kunnen vinden om over de obstakels van Twitter heen te komen. Zo gemotiveerd zijn om nieuwe dingen te ontdekken en daarbij zo out of the box kunnen denken zou ik graag willen toepassen op mijn eigen werk."
        ]
      }
    ]
  },
    {
    "id": "Clarke-Verdel",
    "title": "Clarke Verdel",
    "image": {
      "src": "/images/clarke_verdel.webp",
      "alt": "Clarke Verdel"
    },
    "intro": "Automatisch testen van code",
    "inleiding": "Clarke is een 'T-shapen' frontend engineer bij IO, hij verteld ovet het automatisch testen van code alsof het een echte gebuiker is.",
    "content": [
      {
        "titel": "Software opleveren dat altijd werkt",
        "alinea": [
          "Je kunt als developer denken dat je code goed werkt maar het echte doel is dat je code stabiel blijft in alle situaties. Daarom is goed testen cruciaal. De presentatie besprak de zogenaamde Testing Trophy, een model dat laat zien hoe je verschillende soorten tests het beste inzet.",
          "Het begint allemaal bij tools zoals TypeScript, ESLint en andere linters. Die helpen al vroeg fouten te vinden in je code, nog voordat je de applicatie runt.",
          "Daarna kijk je naar unit en componenttests. werken losse stukjes code of componenten zoals ze moeten? Dat gaat niet alleen om logica, maar ook om visuele elementen.",
          "Vervolgens komt integratietesten, waarbij je controleert of alle verschillende onderdelen goed met elkaar samenwerken. Bijvoorbeeld of een knop op een pagina de juiste data uit de database haalt of dat hij niet een ander component in de weg zit. Dit niveau is vaak het meest complex en wordt ook het vaakst getest.",
          "Tot slot zijn er end-to-end (E2E) tests. Die bootsen echte gebruikersscenario's na in de browser. Nadeel: als je iets in de code verandert, kunnen deze tests snel breken, en moet je alles opnieuw uitvoeren. Dat maakt het tijdrovend.",
          "Testen zorgt voor vertrouwen in je software. Je weet namelijk dat dingen goed reageren, snel zijn, toegankelijk zijn, en er netjes uitzien. Het liefst test je dit soort dingen in een echte browser, maar dat gebeurt niet altijd omdat het vaak veel tijd kost. Maar nu is er Component Browser Testing. Hiermee kun je componenten testen in een echte browseromgeving, met tools die draaien op Vite. Dat zorgt voor snellere feedback, visuele toegankelijkheidschecks, betere debugging en uiteindelijk meer vertrouwen in je code."
        ]
      },
      {
        "titel": "Wat ik mee ga nemen",
        "alinea": [
          "Automatisch testen is iets waar ik nog maar weinig in aanraking ben gekomen naast het gebruiken van een linter. Het is ook niet echt iets dat ik nu direct kan toepassen aangezien dit vooral aansluit op grote projecten waar je met een groot team aan werkt.",
          "Het is wel goed om hiervan gehoord te hebben om mezelf voor te kunnen bereiden op wat er aan zit te komen als ik aan een groot product werk samen met andere developers. Ik denk dat dit wel iets is waar ik in de toekomst sowieso mee in aanraking ga komen.",
          "Ik me hier meer in verdiepen aangezien ik denk dat er veel kennis is op het gebied van testen waarmee ik nu nog niet mee in aanrakingben gekomen."
        ]
      }
    ]
  },
  {
    "id": "Q42",
    "title": "Q42",
    "image": {
      "src": "/images/q42.webp",
      "alt": "Q42 logo"
    },
    "intro": "Project Oculi Mundi en SenseMath",
    "inleiding": "Q42 is een studio gevestigd in Den Haag en Amsterdam. Tijdens deze weekly nerd vertellen ze ove twee projecten die ze hebben gedaan die laten zien wat er mogelijk is met web tech en hoe ze omgaan met een specifieke doelgroep.",
    "content": [
      {
        "titel": "Oculi Mundi collection",
        "alinea": [
          "Een van de projecten van Q42 was in opdracht van een vrouw uit het buitenland. Haar familie verzamelde al jarenlang kaarten en kunstwerken, en ze wilde een website laten maken om die collectie op een bijzondere en creatieve manier te laten zien. 'I do not want your mama's website' Daarvoor ontwikkelde Q42 een 3D-website, waarbij de navigatie-items als planeten in een ruimtelijk universum zweven, en elk kunstwerk in die 3D-wereld wordt gepresenteerd.",
          "In plaats van  gewoon van boven naar beneden scrollen, beweeg je op deze site de diepte in. Het voelt alsof je naar voren wordt getrokken. Dit effect hebben ze alleen met HTML en CSS gemaakt. Er is ook een onderzoeksmodus waar het vooral om data en niet om de visuals omdat deze website ook door onderzoekers word gebruikt om naar oude kaarten te kunnen kijken en tot in de kleine details in te inzoomen.",
          "Met al deze functies hebben ze het ook voor elkaar gekregen om alles in eerste instatie vanuit toegankelijkheid te benaderen. Alles is voor iedereen bereikbaar en het is visueel ook nog eens heel aantrekkelijk."
        ]
      },
      {
        "titel": "SenseMath grafieken",
        "alinea": [
          "SenseMath is een project dat speciaal is gemaakt voor blinde mensen. Door middel van dit product is het mogelijk voor blinde mensen om wiskundige grafieken te lezen door middel van geluid, Door goed te letten op hoe het geluid klinkt kan je in je hooft een de lijn tekenen die door de grafiek heen gaat. Er zitten hele kleine detail in het geluid om verschillende dingen aan te duiden, bijvoorbeeld een geluid wannere de lijn door een as heet gaat in de grafiek en waar snijpunten zitten.",
          "Wat opviel tijdens dit project was hoeveel het ging over het ontwerpen voor specifike mensen en niet perse over de development van het product. Er werd verteld over welek kleine details er zijn toegevoegd na met echte gebruikers getest te hebben, hun feedback te verwerken en mee te nemen welke geluiden het meest duidelijk zouden zijn voor de gebruiker."
        ]
      },
      {
        "titel": "Wat ik mee ga nemen",
        "alinea": [
          "Wat mij opviel bij Q42 is dat ze altijd vanaf het perspectief van toegankelijkheid beginnen bij het ontwikkelen van een product. Ik wil dit graag meenemen in mijn eiogen projecten zodat toegankelijkheid niet een ding is dat ik achteraf moet toevoegen. Ik denk dat je tot een veel beter en compleet product komt als je vanaf begin af aan ontwerpt voor toegankelijkheid, de producten van Q42 zijn hier het bewijs van.",
          "Q42 liet veel zien waarvan ik eerder nog nooit ove had nagedacht, het was erg inspirerend om te zien hoe ze met probelemn om gaan en hoe iedereen op zoek is naar de beste oplossing."
        ]
      }
    ]
  },
    {
    "id": "Marieke-de-Hoop",
    "title": "Marieke de Hoop",
    "image": {
      "src": "/images/marieke_de_hoop.webp",
      "alt": "Marieke de Hoop"
    },
    "intro": "Digitale toegenkelijkheid",
    "inleiding": "Merieke werkt bij digitaal toegankelijk, hier voeren zij  toegankelijkheids autits uit voor websites. Zij geven vervolgens ook advies voor de bedrijven waarmee ze werken.",
    "content": [
      {
        "titel": "Digitale toegankelijkheid",
        "alinea": [
          "Marieke geeft eerst een korte uitleg over wat digitale toegankelijkheid inhoudt. We hebben het hier over mensen met een beperking, zowel tijdelijk als permanente beprkingen. We hebben het ook over dat elke beperking een persoonlijke ervaring is en dat je mensen niet over één kam kan scheren.",
          "Bij een audit van digitale toegankelijk word een product van een bedrijf getoetst op teogeankelijkheid, het is een systematische toets dat door de verschillende aspecten gaat van toegankelijkheid. een aantal hiervan zijn styling, contrast tussen kleuren, typografie, etc."
        ]
      },
            {
        "titel": "EAA (European Accessibility Act)",
        "alinea": [
          "Bij deze prsentatie kregen we meer uitleg over de 'European Accessibility Act'. We hebben al eerder van de term gehoord tijdens de minor maar nog geen uitleg van wat het inhoudt.",
          "Alle bedrijven die aan consumenten in de EU leveren moeten hier aan voldoen, natuurlijk zijn er een aantal uizonderingen maar in principe moet elk grote bedrijf aan deze regels voldoen. De gevolgen voor niet voldoen aan deze regels zijn erg groot voor het bedrijf als ze na een melding niks doen."
        ]
      },
      {
        "titel": "Wat ik mee ga nemen",
        "alinea": [
          "Het was fijn om iets meer uitleg te krijgen over een begrip dat ik vaker heb gehoord om meer invulling te krijgen van wat het betekend. Alhoewel denk ik dat ik er pas echt mee in aanraking ga komen in het werkveld waar ik er daadwerkelijk echt rekening mee moet houden.",
          "Het begrip is nogsteeds vaag maar ik begrijp nu wel de omvang van hoeveel invloed het heeft op het web. Over het algemeen denk ik dat het een goed ding is dat de Eu dit in beweging heeft gebracht alhoewel vind ik het jammer dat bedrijven op deze manier pas rekening houden met toegankelijkheid in plaats van het in eerste instantie al te doen."
        ]
      }
    ]
  }
]
